Repository: simonweniger/agentkit
Catalog: locale/*/LC_MESSAGES/agentkit.po
Languages: pt_br

source: Did not found name '{}' from model or statemachine
pt_br: Não encontrou o nome '{}' no modelo ou na máquina de estados

source: {!r} is not a valid state value.
pt_br: {!r} não é um valor de estado válido.

source: Can't {} when in {}.
pt_br: Não é possível {} quando está em {}.

source: There are no states.
pt_br: Não há estados.

source: There are no events.
pt_br: Não há eventos.

source: There should be one and only one initial state. You currently have these: {!r}
pt_br: Deve haver um e apenas um estado inicial. Você atualmente tem estes: {!r}

source: Cannot declare transitions from final state. Invalid state(s): {}
pt_br: Não é possível declarar transições a partir do estado final. Estado(s) inválido(s): {}

source: All non-final states should have at least one outgoing transition. These states have no outgoing transition: {!r}
pt_br: Todos os estados não finais devem ter pelo menos uma transição de saída. Esses estados não têm transição de saída: {!r}

source: All non-final states should have at least one path to a final state. These states have no path to a final state: {!r}
pt_br: Todos os estados não finais devem ter pelo menos um caminho para um estado final. Esses estados não têm caminho para um estado final: {!r}

source: There are unreachable states. The statemachine graph should have a single component. Disconnected states: {}
pt_br: Há estados inacessíveis. O gráfico da máquina de estados deve ter um único componente. Estados desconectados: {}

source: {!r} is not a valid state machine name.
pt_br: {!r} não é um nome válido para uma máquina de estados.

source: State overriding is not allowed. Trying to add '{}' to {}
pt_br: Sobrescrever estados não é permitido. Tentando adicionar '{}' a {}

source: There are no states or transitions.
pt_br: Não há estados ou transições.

source: There's no current state set. In async code, did you activate the initial state? (e.g., `await sm.activate_initial_state()`)
pt_br: Não há estado atual definido. No código assíncrono, você ativou o estado inicial? (por exemplo, `await sm.activate_initial_state()`)
